Repository: 84000/data-translation-memory
Catalog: toh72-v4.tmx
Source language: bo
Languages: en

source: །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས། འདི་ཇི་ལྟར་གཟུང་བར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed One, what is the name of this Dharma discourse? How should we remember it?”

source: ཀུན་དགའ་བོ་དེའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱང་ཆུབ་སེམས་དཔའི་རྣལ་འབྱོར་སྤྱོད་པའི་ས་བསྟན་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །དཔས་བྱིན་གྱིས་ཞུས་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: The Blessed One replied, “In this regard, Ānanda, this Dharma discourse is called The Teaching on the Stages of Yoga for Bodhisattvas, and this is how it should be remembered. It should also be remembered as The Questions of Vīradatta.

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། དགེ་སློང་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཁྱིམ་བདག་ལྔ་བརྒྱ་ཙམ་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: When the Blessed One had uttered these words, the venerable Ānanda, the monks, the bodhisattvas, the five hundred householders, and the world with its gods, humans, asuras, and gandharvas all rejoiced and praised what had been proclaimed by the Blessed One.

source: །འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས་ཁྱིམ་བདག་དཔས་བྱིན་གྱིས་ཞུས་པའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་རྩ་བརྒྱད་པ་རྫོགས་སོ།། །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།། །།
en: This concludes The Questions of the Householder Vīradatta, the twenty-eighth of the one hundred thousand sections of the Dharma discourse known as The Noble Great Heap of Jewels. Translated, edited, and finalized according to the new terminological register by the Indian preceptors Jinamitra and Dānaśīla, and the chief editor-translator Bandé Yeshé Dé.
